; domain
(define (domain domain1)

(:requirements :strips :typing)

(:types
    location                ; different locations (example: central_warehouse)

    locatable               ; parent type for agents, supplies, boxes, workstations
                            ; to allow located(locatable, location)

    agent - locatable       ; the robotic agents
    agent_type_1 - agent

    supply - locatable      ; supplies needed by the workstations

    box - locatable         ; boxes containing needed supplies

    workstation - locatable ; there are a number of workstations
)

(:predicates
    (connected ?l1 ?l2 - location)          ; location ?l1 is connected to ?l2 - the "roadmap"

    (located ?x - locatable ?l - location) ; ?x is at location ?l

    (contains ?b - box ?s - supply)         ; box ?b contains supply ?s
    (isempty ?b - box)                      ; box ?b is empty

    (loaded ?a - agent ?b - box)            ; box ?b is loaded on agent ?a
    (free ?a - agent)                          ; agent ?a is free, not loaded
    (unloaded ?b - box)                     ; box ?b is unloaded, not on an agent

    (has ?w - workstation ?s - supply)      ; workstation ?w has supply ?s
    (needs ?w - workstation ?s - supply)     ; workstation ?w needs supply ?s
)

; agent ?a fills box ?b with supply ?s at location ?l
(:action fill
    :parameters (?a - agent ?b - box ?s - supply ?l - location)
    :precondition (and 
        (located ?a ?l) (located ?b ?l) (located ?s ?l) ; agent, box, supply in the same location
        (isempty ?b)                                    ; box empty
        (unloaded ?b)                                   ; box unloaded
    )
    :effect (and 
        (not (isempty ?b)) (contains ?b ?s)
    )
)

; agent ?a empty box ?b in location ?l, leaving supply ?s to workstation ?w
(:action empty
    :parameters (?a - agent ?b - box ?s - supply ?w - workstation ?l - location)
    :precondition (and 
        (located ?a ?l) (located ?b ?l) (located ?w ?l) ; agent, box, workstation in the same location
        (contains ?b ?s) (needs ?w ?s)                  ; box must contain the needed supply for the workstation
        (unloaded ?b)                                   ; box unloaded
    )
    :effect (and 
        (has ?w ?s) (not (needs ?w ?s))         ; cause the workstation to have it 
        (not (contains ?b ?s)) (isempty ?b)     ; and the box becomes empty 
    )
)

; agent ?a moves from location ?from to location ?to
; if loaded with a box also the box moves, but
; the movement of the box loaded on the agent is modeled by load/unload actions
(:action move
    :parameters (?a - agent ?from ?to - location)
    :precondition (and 
        (located ?a ?from)      ; agent should be in ?from
        (connected ?from ?to)   ; ?from, ?to must be connected 
    )
    :effect (and 
        (not (located ?a ?from)) (located ?a ?to)
    )
)

; agent ?a loads box ?b at location ?l
(:action load
    :parameters (?a - agent ?b - box ?l - location)
    :precondition (and 
        (located ?a ?l) (located ?b ?l) ; agent, box in the same location
        (free ?a) (unloaded ?b)         ; agent must be free (no box on it) and the box unloaded (not on other agents)
    )
    :effect (and 
        (loaded ?a ?b) 
        (not (unloaded ?b)) 
        (not (free ?a))         ; agent loaded
        (not (located ?b ?l))   ; box no more located ?l
    )
)

; agent ?a unloads box ?b at location ?l
(:action unload
    :parameters (?a - agent ?b - box ?l - location)
    :precondition (and 
        (located ?a ?l) ; agent must be in location ?l
        (loaded ?a ?b)  ; agent must be laoded
    )
    :effect (and 
        (free ?a) (unloaded ?b) (not (loaded ?a ?b))    ; agent is free and box unloaded from agent
        (located ?b ?l)                                 ; box is now located at unload location
    )
)

)

; problem
(define (problem problem1) (:domain domain1)
(:objects 

    ; locations
    central_warehouse loc1 loc2 - location

    ; 2 boxes
    box1 box2 - box

    ; 3 workstations
    ws1 ws2 ws3 - workstation

    ; robotic agent
    agent1 - agent_type_1

    ; supplies
    bolt valve tool - supply
)

(:init
    
    ; all boxes at central_warehouse
    (located box1 central_warehouse)
    (located box2 central_warehouse)

    ; all the boxes are empty and unloaded (not on agents)
    (isempty box1)
    (unloaded box1)
    (isempty box2)
    (unloaded box2)

    ; all content/supply at central_warehouse
    (located bolt central_warehouse)
    (located valve central_warehouse)
    (located tool central_warehouse)

    ; robotic agent at central_warehouse and free
    (located agent1 central_warehouse)
    (free agent1)


    ; workstations ws1 and ws2 at location_ws
    ; workstation ws3 at central_warehouse
    (located ws1 loc1)
    (located ws2 loc1)
    (located ws3 loc2)

    ; central_warehouse and loc1 are connected
    (connected central_warehouse loc1)
    (connected loc1 central_warehouse)
    ; central_warehouse and loc2 are connected
    (connected central_warehouse loc2)
    (connected loc2 central_warehouse)


    ; needs == not have     
    ; ws1 needs only tool
    (needs ws1 tool)

    ; ws2 needs no supply
    
    ; ws3 needs bolt valve tool
    (needs ws3 bolt)
    (needs ws3 valve)
    (needs ws3 tool)

)

(:goal (and
    ; ws1 has tool
    (has ws1 tool)

    ; ws2 has no supply / not need supply
    
    ; ws3 has bolt valve tool
    (has ws3 bolt)
    (has ws3 valve)
    (has ws3 tool)
))

)

; plan
1. (fill agent1 box1 valve central_warehouse)
   deleted: (isempty box1)
   added: (contains box1 valve)
   goals met: 0 of 4
2. (load agent1 box1 central_warehouse)
   deleted: (unloaded box1) (free agent1) (located box1 central_warehouse)
   added: (loaded agent1 box1)
   goals met: 0 of 4
3. (move agent1 central_warehouse loc2)
   deleted: (located agent1 central_warehouse)
   added: (located agent1 loc2)
   goals met: 0 of 4
4. (unload agent1 box1 loc2)
   deleted: (loaded agent1 box1)
   added: (free agent1) (unloaded box1) (located box1 loc2)
   goals met: 0 of 4
5. (empty agent1 box1 valve ws3 loc2)
   deleted: (needs ws3 valve) (contains box1 valve)
   added: (has ws3 valve) (isempty box1)
   goals met: 1 of 4
6. (load agent1 box1 loc2)
   deleted: (unloaded box1) (free agent1) (located box1 loc2)
   added: (loaded agent1 box1)
   goals met: 1 of 4
7. (move agent1 loc2 central_warehouse)
   deleted: (located agent1 loc2)
   added: (located agent1 central_warehouse)
   goals met: 1 of 4
8. (fill agent1 box2 tool central_warehouse)
   deleted: (isempty box2)
   added: (contains box2 tool)
   goals met: 1 of 4
9. (unload agent1 box1 central_warehouse)
   deleted: (loaded agent1 box1)
   added: (free agent1) (unloaded box1) (located box1 central_warehouse)
   goals met: 1 of 4
10. (fill agent1 box1 tool central_warehouse)
   deleted: (isempty box1)
   added: (contains box1 tool)
   goals met: 1 of 4
11. (load agent1 box2 central_warehouse)
   deleted: (unloaded box2) (free agent1) (located box2 central_warehouse)
   added: (loaded agent1 box2)
   goals met: 1 of 4
12. (move agent1 central_warehouse loc1)
   deleted: (located agent1 central_warehouse)
   added: (located agent1 loc1)
   goals met: 1 of 4
13. (unload agent1 box2 loc1)
   deleted: (loaded agent1 box2)
   added: (free agent1) (unloaded box2) (located box2 loc1)
   goals met: 1 of 4
14. (empty agent1 box2 tool ws1 loc1)
   deleted: (needs ws1 tool) (contains box2 tool)
   added: (has ws1 tool) (isempty box2)
   goals met: 2 of 4
15. (load agent1 box2 loc1)
   deleted: (unloaded box2) (free agent1) (located box2 loc1)
   added: (loaded agent1 box2)
   goals met: 2 of 4
16. (move agent1 loc1 central_warehouse)
   deleted: (located agent1 loc1)
   added: (located agent1 central_warehouse)
   goals met: 2 of 4
17. (unload agent1 box2 central_warehouse)
   deleted: (loaded agent1 box2)
   added: (free agent1) (unloaded box2) (located box2 central_warehouse)
   goals met: 2 of 4
18. (load agent1 box1 central_warehouse)
   deleted: (unloaded box1) (free agent1) (located box1 central_warehouse)
   added: (loaded agent1 box1)
   goals met: 2 of 4
19. (fill agent1 box2 bolt central_warehouse)
   deleted: (isempty box2)
   added: (contains box2 bolt)
   goals met: 2 of 4
20. (move agent1 central_warehouse loc2)
   deleted: (located agent1 central_warehouse)
   added: (located agent1 loc2)
   goals met: 2 of 4
21. (unload agent1 box1 loc2)
   deleted: (loaded agent1 box1)
   added: (free agent1) (unloaded box1) (located box1 loc2)
   goals met: 2 of 4
22. (empty agent1 box1 tool ws3 loc2)
   deleted: (needs ws3 tool) (contains box1 tool)
   added: (has ws3 tool) (isempty box1)
   goals met: 3 of 4
23. (move agent1 loc2 central_warehouse)
   deleted: (located agent1 loc2)
   added: (located agent1 central_warehouse)
   goals met: 3 of 4
24. (load agent1 box2 central_warehouse)
   deleted: (unloaded box2) (free agent1) (located box2 central_warehouse)
   added: (loaded agent1 box2)
   goals met: 3 of 4
25. (move agent1 central_warehouse loc2)
   deleted: (located agent1 central_warehouse)
   added: (located agent1 loc2)
   goals met: 3 of 4
26. (unload agent1 box2 loc2)
   deleted: (loaded agent1 box2)
   added: (free agent1) (unloaded box2) (located box2 loc2)
   goals met: 3 of 4
27. (empty agent1 box2 bolt ws3 loc2)
   deleted: (needs ws3 bolt) (contains box2 bolt)
   added: (has ws3 bolt) (isempty box2)
   goals met: 4 of 4
